zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K324_DMA_TCD.h
/*! @name TCD27_NBYTES_MLOFFYES - TCD Transfer Size with Minor Loop Offsets */
/*! @{ */

#define DMA_TCD_TCD27_NBYTES_MLOFFYES_NBYTES_MASK (0x3FFU)
#define DMA_TCD_TCD27_NBYTES_MLOFFYES_NBYTES_SHIFT (0U)
#define DMA_TCD_TCD27_NBYTES_MLOFFYES_NBYTES_WIDTH (10U)
#define DMA_TCD_TCD27_NBYTES_MLOFFYES_NBYTES(x)  (((uint32_t)(((uint32_t)(x)) << DMA_TCD_TCD27_NBYTES_MLOFFYES_NBYTES_SHIFT)) & DMA_TCD_TCD27_NBYTES_MLOFFYES_NBYTES_MASK)

#define DMA_TCD_TCD27_NBYTES_MLOFFYES_MLOFF_MASK (0x3FFFFC00U)
#define DMA_TCD_TCD27_NBYTES_MLOFFYES_MLOFF_SHIFT (10U)
#define DMA_TCD_TCD27_NBYTES_MLOFFYES_MLOFF_WIDTH (20U)
#define DMA_TCD_TCD27_NBYTES_MLOFFYES_MLOFF(x)   (((uint32_t)(((uint32_t)(x)) << DMA_TCD_TCD27_NBYTES_MLOFFYES_MLOFF_SHIFT)) & DMA_TCD_TCD27_NBYTES_MLOFFYES_MLOFF_MASK)

#define DMA_TCD_TCD27_NBYTES_MLOFFYES_DMLOE_MASK (0x40000000U)
#define DMA_TCD_TCD27_NBYTES_MLOFFYES_DMLOE_SHIFT (30U)
#define DMA_TCD_TCD27_NBYTES_MLOFFYES_DMLOE_WIDTH (1U)
#define DMA_TCD_TCD27_NBYTES_MLOFFYES_DMLOE(x)   (((uint32_t)(((uint32_t)(x)) << DMA_TCD_TCD27_NBYTES_MLOFFYES_DMLOE_SHIFT)) & DMA_TCD_TCD27_NBYTES_MLOFFYES_DMLOE_MASK)

#define DMA_TCD_TCD27_NBYTES_MLOFFYES_SMLOE_MASK (0x80000000U)
#define DMA_TCD_TCD27_NBYTES_MLOFFYES_SMLOE_SHIFT (31U)
#define DMA_TCD_TCD27_NBYTES_MLOFFYES_SMLOE_WIDTH (1U)
#define DMA_TCD_TCD27_NBYTES_MLOFFYES_SMLOE(x)   (((uint32_t)(((uint32_t)(x)) << DMA_TCD_TCD27_NBYTES_MLOFFYES_SMLOE_SHIFT)) & DMA_TCD_TCD27_NBYTES_MLOFFYES_SMLOE_MASK)
/*! @} */

/*! @name TCD27_SLAST_SDA - TCD Last Source Address Adjustment / Store DADDR Address */
/*! @{ */

#define DMA_TCD_TCD27_SLAST_SDA_SLAST_SDA_MASK   (0xFFFFFFFFU)
#define DMA_TCD_TCD27_SLAST_SDA_SLAST_SDA_SHIFT  (0U)
#define DMA_TCD_TCD27_SLAST_SDA_SLAST_SDA_WIDTH  (32U)
#define DMA_TCD_TCD27_SLAST_SDA_SLAST_SDA(x)     (((uint32_t)(((uint32_t)(x)) << DMA_TCD_TCD27_SLAST_SDA_SLAST_SDA_SHIFT)) & DMA_TCD_TCD27_SLAST_SDA_SLAST_SDA_MASK)
/*! @} */

/*! @name TCD27_DADDR - TCD Destination Address */
/*! @{ */

#define DMA_TCD_TCD27_DADDR_DADDR_MASK           (0xFFFFFFFFU)
#define DMA_TCD_TCD27_DADDR_DADDR_SHIFT          (0U)
#define DMA_TCD_TCD27_DADDR_DADDR_WIDTH          (32U)
#define DMA_TCD_TCD27_DADDR_DADDR(x)             (((uint32_t)(((uint32_t)(x)) << DMA_TCD_TCD27_DADDR_DADDR_SHIFT)) & DMA_TCD_TCD27_DADDR_DADDR_MASK)
/*! @} */

/*! @name TCD27_DOFF - TCD Signed Destination Address Offset */
/*! @{ */

#define DMA_TCD_TCD27_DOFF_DOFF_MASK             (0xFFFFU)
#define DMA_TCD_TCD27_DOFF_DOFF_SHIFT            (0U)
#define DMA_TCD_TCD27_DOFF_DOFF_WIDTH            (16U)
#define DMA_TCD_TCD27_DOFF_DOFF(x)               (((uint16_t)(((uint16_t)(x)) << DMA_TCD_TCD27_DOFF_DOFF_SHIFT)) & DMA_TCD_TCD27_DOFF_DOFF_MASK)
/*! @} */

/*! @name TCD27_CITER_ELINKNO - TCD Current Major Loop Count (Minor Loop Channel Linking Disabled) */
/*! @{ */

#define DMA_TCD_TCD27_CITER_ELINKNO_CITER_MASK   (0x7FFFU)
#define DMA_TCD_TCD27_CITER_ELINKNO_CITER_SHIFT  (0U)
#define DMA_TCD_TCD27_CITER_ELINKNO_CITER_WIDTH  (15U)
#define DMA_TCD_TCD27_CITER_ELINKNO_CITER(x)     (((uint16_t)(((uint16_t)(x)) << DMA_TCD_TCD27_CITER_ELINKNO_CITER_SHIFT)) & DMA_TCD_TCD27_CITER_ELINKNO_CITER_MASK)

#define DMA_TCD_TCD27_CITER_ELINKNO_ELINK_MASK   (0x8000U)
#define DMA_TCD_TCD27_CITER_ELINKNO_ELINK_SHIFT  (15U)
#define DMA_TCD_TCD27_CITER_ELINKNO_ELINK_WIDTH  (1U)
#define DMA_TCD_TCD27_CITER_ELINKNO_ELINK(x)     (((uint16_t)(((uint16_t)(x)) << DMA_TCD_TCD27_CITER_ELINKNO_ELINK_SHIFT)) & DMA_TCD_TCD27_CITER_ELINKNO_ELINK_MASK)
/*! @} */

/*! @name TCD27_CITER_ELINKYES - TCD Current Major Loop Count (Minor Loop Channel Linking Enabled) */
/*! @{ */

#define DMA_TCD_TCD27_CITER_ELINKYES_CITER_MASK  (0x1FFU)
#define DMA_TCD_TCD27_CITER_ELINKYES_CITER_SHIFT (0U)
#define DMA_TCD_TCD27_CITER_ELINKYES_CITER_WIDTH (9U)
#define DMA_TCD_TCD27_CITER_ELINKYES_CITER(x)    (((uint16_t)(((uint16_t)(x)) << DMA_TCD_TCD27_CITER_ELINKYES_CITER_SHIFT)) & DMA_TCD_TCD27_CITER_ELINKYES_CITER_MASK)

#define DMA_TCD_TCD27_CITER_ELINKYES_LINKCH_MASK (0x3E00U)
#define DMA_TCD_TCD27_CITER_ELINKYES_LINKCH_SHIFT (9U)
#define DMA_TCD_TCD27_CITER_ELINKYES_LINKCH_WIDTH (5U)
#define DMA_TCD_TCD27_CITER_ELINKYES_LINKCH(x)   (((uint16_t)(((uint16_t)(x)) << DMA_TCD_TCD27_CITER_ELINKYES_LINKCH_SHIFT)) & DMA_TCD_TCD27_CITER_ELINKYES_LINKCH_MASK)

#define DMA_TCD_TCD27_CITER_ELINKYES_ELINK_MASK  (0x8000U)
#define DMA_TCD_TCD27_CITER_ELINKYES_ELINK_SHIFT (15U)
#define DMA_TCD_TCD27_CITER_ELINKYES_ELINK_WIDTH (1U)
#define DMA_TCD_TCD27_CITER_ELINKYES_ELINK(x)    (((uint16_t)(((uint16_t)(x)) << DMA_TCD_TCD27_CITER_ELINKYES_ELINK_SHIFT)) & DMA_TCD_TCD27_CITER_ELINKYES_ELINK_MASK)
/*! @} */

/*! @name TCD27_DLAST_SGA - TCD Last Destination Address Adjustment / Scatter Gather Address */
/*! @{ */

#define DMA_TCD_TCD27_DLAST_SGA_DLAST_SGA_MASK   (0xFFFFFFFFU)
#define DMA_TCD_TCD27_DLAST_SGA_DLAST_SGA_SHIFT  (0U)
#define DMA_TCD_TCD27_DLAST_SGA_DLAST_SGA_WIDTH  (32U)
#define DMA_TCD_TCD27_DLAST_SGA_DLAST_SGA(x)     (((uint32_t)(((uint32_t)(x)) << DMA_TCD_TCD27_DLAST_SGA_DLAST_SGA_SHIFT)) & DMA_TCD_TCD27_DLAST_SGA_DLAST_SGA_MASK)
/*! @} */

/*! @name TCD27_CSR - TCD Control and Status */
/*! @{ */

#define DMA_TCD_TCD27_CSR_START_MASK             (0x1U)
#define DMA_TCD_TCD27_CSR_START_SHIFT            (0U)
#define DMA_TCD_TCD27_CSR_START_WIDTH            (1U)
#define DMA_TCD_TCD27_CSR_START(x)               (((uint16_t)(((uint16_t)(x)) << DMA_TCD_TCD27_CSR_START_SHIFT)) & DMA_TCD_TCD27_CSR_START_MASK)

#define DMA_TCD_TCD27_CSR_INTMAJOR_MASK          (0x2U)
#define DMA_TCD_TCD27_CSR_INTMAJOR_SHIFT         (1U)
#define DMA_TCD_TCD27_CSR_INTMAJOR_WIDTH         (1U)
#define DMA_TCD_TCD27_CSR_INTMAJOR(x)            (((uint16_t)(((uint16_t)(x)) << DMA_TCD_TCD27_CSR_INTMAJOR_SHIFT)) & DMA_TCD_TCD27_CSR_INTMAJOR_MASK)

#define DMA_TCD_TCD27_CSR_INTHALF_MASK           (0x4U)
#define DMA_TCD_TCD27_CSR_INTHALF_SHIFT          (2U)
#define DMA_TCD_TCD27_CSR_INTHALF_WIDTH          (1U)
#define DMA_TCD_TCD27_CSR_INTHALF(x)             (((uint16_t)(((uint16_t)(x)) << DMA_TCD_TCD27_CSR_INTHALF_SHIFT)) & DMA_TCD_TCD27_CSR_INTHALF_MASK)

